Catalogs/ЗапросыСУБД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Catalog>
		<Properties>
			<Name>ЗапросыСУБД</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПараметрыСоединения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПараметрыСоединенийСУБД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстЗапроса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЗапроса</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыЗапросовСУБД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Таймаут</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УстановитьТаймаут</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПараметрыЗапроса</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяПараметра</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/ТипыЗапросовСУБД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Enum>
		<Properties>
			<Name>ТипыЗапросовСУБД</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Запрос</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Команда</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ТипыСУБД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Enum>
		<Properties>
			<Name>ТипыСУБД</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>SQLite</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>MSSQLServer</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>MySQL</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>PostgreSQL</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ЗапросыСУБД/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
	ЭтаФорма.Элементы.Таймаут.ТолькоПросмотр = Не Объект.УстановитьТаймаут;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ТестСоединения(Команда)
	ТестСоединенияНаСервере();
	Сообщить("Тест соединения выполнен успешно");
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьЗапрос(Команда)
	ВыполнитьЗапросНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СформироватьКодСОбработками(Команда)
	// Вставить содержимое обработчика.
	ДокументКод = Новый ТекстовыйДокумент;
	
	// Добавляем комментарий
	ДокументКод.ДобавитьСтроку("// " + Объект.Наименование);
	ДокументКод.ДобавитьСтроку("");
	
	// Создаем и открываем соединение
	ДокументКод.ДобавитьСтроку("// Соединение");
	ДокументКод.ДобавитьСтроку("Соединение = Обработки.СоединениеСУБД.Создать();");
	
	Если ПараметрыСоединенияКакЗначения = Истина Тогда
		ДокументКод.ДобавитьСтроку("Соединение.СтрокаСоединения = """ + ПолучитьСтрокуСоединения() + """;");
		ДокументКод.ДобавитьСтроку("Соединение.ТипСУБД = Обработки.СоединениеСУБД.ТипыСУБД()." + ПолучитьТипСУБД() + ";");
	Иначе	
		ДокументКод.ДобавитьСтроку("Соединение.СтрокаСоединения = Обработки.ПараметрыСоединенияСУБД.ПолучитьСтрокуСоединения(""" + ПолучитьКодПараметрыСоединения() + """);");
		ДокументКод.ДобавитьСтроку("Соединение.ТипСУБД = Обработки.ПараметрыСоединенияСУБД.ПолучитьТипСУБД(""" + ПолучитьКодПараметрыСоединения() + """);");	
	КонецЕсли;

	ДокументКод.ДобавитьСтроку("Соединение.Открыть();");
	ДокументКод.ДобавитьСтроку("");
	
	// Добавляем инициализацию параметров
	
	Для каждого Параметр Из Объект.ПараметрыЗапроса Цикл
	
		ДокИнициализацияПараметра = Новый ТекстовыйДокумент();
		ДокИнициализацияПараметра.УстановитьТекст(Параметр.Значение);
		
		ДокументКод.ДобавитьСтроку("// Имя переменной: " + Параметр.Имя);
		ДокументКод.ДобавитьСтроку("// Имя параметра: " + Параметр.ИмяПараметра);
		ДокументКод.ДобавитьСтроку("// ");
		
		Для ИндексСтроки = 1 По ДокИнициализацияПараметра.КоличествоСтрок() Цикл
			ДокументКод.ДобавитьСтроку(ДокИнициализацияПараметра.ПолучитьСтроку(ИндексСтроки));
		КонецЦикла;
		
		ДокументКод.ДобавитьСтроку("");
	
	КонецЦикла;
	
	// Добавляем текст запроса
	ДокТекстЗапроса = Новый ТекстовыйДокумент();
	ДокТекстЗапроса.УстановитьТекст(Объект.ТекстЗапроса);
	
	ДокументКод.ДобавитьСтроку("Запрос = Соединение.СоздатьЗапрос();");
	
	Если Объект.УстановитьТаймаут = Истина Тогда
		ДокументКод.ДобавитьСтроку("Запрос.Таймаут = " + Формат(Объект.Таймаут, "ЧГ=0") + ";");
	КонецЕсли;

	ДокументКод.ДобавитьСтроку("Запрос.Текст = """);
	
	Для ИндексСтроки = 1 По ДокТекстЗапроса.КоличествоСтрок() Цикл
	
		ДокументКод.ДобавитьСтроку("| " + ДокТекстЗапроса.ПолучитьСтроку(ИндексСтроки));	
	
	КонецЦикла;
	
	ДокументКод.ДобавитьСтроку("|"";");
	ДокументКод.ДобавитьСтроку("");
	
	// Добавляем установку параметров
	
	Для каждого Параметр Из Объект.ПараметрыЗапроса Цикл
	
		ДокументКод.ДобавитьСтроку("Запрос.УстановитьПараметр(""" + Параметр.ИмяПараметра + """, " + Параметр.Имя + ");");
	
	КонецЦикла;
	
	ДокументКод.ДобавитьСтроку("");
	
	// Выполняем запрос и выгружаем результаты
	Если ЭтоЗапрос() Тогда
		ДокументКод.ДобавитьСтроку("Результаты = Запрос.ВыполнитьЗапрос().Выгрузить();");
	Иначе
		ДокументКод.ДобавитьСтроку("КоличествоСтрок = Запрос.ВыполнитьКоманду();");
	КонецЕсли;
	
	ДокументКод.ДобавитьСтроку("Соединение.Закрыть();");
	
	//
	ДокументКод.Показать(Объект.Наименование);
	
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьКодКлассическийСтиль(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ТестСоединенияНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаСервере
Процедура ВыполнитьЗапросНаСервере()
	// Вставить содержимое обработчика.
	_Соединение = Обработки.СоединениеСУБД.Создать();
	_Соединение.ТипСУБД = ПолучитьТипСУБДКакЧисло();
	_Соединение.СтрокаСоединения = Объект.ПараметрыСоединения.СтрокаСоединения;
	_Соединение.Открыть();
	
	_Запрос = _Соединение.СоздатьЗапрос();
	_Запрос.Текст = Объект.ТекстЗапроса;
	
	Если Объект.УстановитьТаймаут Тогда
		_Запрос.Таймаут = Объект.Таймаут;
	КонецЕсли;
	
	Для каждого _Параметр Из Объект.ПараметрыЗапроса Цикл
		
		//Значение = Неопределено;
		Выполнить(_Параметр.Значение + ";" +
		"_Запрос.УстановитьПараметр(_Параметр.ИмяПараметра, " + _Параметр.Имя + ");" );
	
	КонецЦикла; 
	
	Если Объект.ТипЗапроса = Перечисления.ТипыЗапросовСУБД.Запрос Тогда
		_Результат = _Запрос.ВыполнитьЗапрос();
		_Таблица = _Результат.Выгрузить();
		_КоличествоСтрок = _Таблица.Количество();
		СформироватьТабличныйДокумент(_Таблица);
	Иначе
		_КоличествоСтрок = _Запрос.ВыполнитьКоманду();
		//_Таблица = Новый ТаблицаЗначений();
		РезультатыЗапроса.Очистить();
	КонецЕсли;
	
	//СформироватьТабличныйДокумент(_Таблица);
	Сообщить("Количество строк: " + Строка(_КоличествоСтрок));

КонецПроцедуры

&НаСервере
Функция ЭтоЗапрос()
	
	Возврат Объект.ТипЗапроса = Перечисления.ТипыЗапросовСУБД.Запрос;
	
КонецФункции

&НаСервере
Функция ПолучитьСтрокуСоединения()
	
	Возврат Объект.ПараметрыСоединения.СтрокаСоединения;
	
КонецФункции

&НаСервере
Функция ПолучитьТипСУБД()
	
	Если Объект.ПараметрыСоединения.ТипСУБД = Перечисления.ТипыСУБД.SQLite Тогда
		Возврат "SQLite";
	ИначеЕсли Объект.ПараметрыСоединения.ТипСУБД = Перечисления.ТипыСУБД.MSSQLServer Тогда
		Возврат "MSSQLServer";
	ИначеЕсли Объект.ПараметрыСоединения.ТипСУБД = Перечисления.ТипыСУБД.MySQL Тогда
		Возврат "MySQL";
	ИначеЕсли Объект.ПараметрыСоединения.ТипСУБД = Перечисления.ТипыСУБД.PostgreSQL Тогда
		Возврат "PostgreSQL";
	Иначе
		ВызватьИсключение "Неизвестный тип СУБД";
	КонецЕсли;
		
КонецФункции

&НаСервере
Функция ПолучитьТипСУБДКакЧисло()
	
	Если Объект.ПараметрыСоединения.ТипСУБД = Перечисления.ТипыСУБД.SQLite Тогда
		Возврат 0;
	ИначеЕсли Объект.ПараметрыСоединения.ТипСУБД = Перечисления.ТипыСУБД.MSSQLServer Тогда
		Возврат 1;
	ИначеЕсли Объект.ПараметрыСоединения.ТипСУБД = Перечисления.ТипыСУБД.MySQL Тогда
		Возврат 2;
	ИначеЕсли Объект.ПараметрыСоединения.ТипСУБД = Перечисления.ТипыСУБД.PostgreSQL Тогда
		Возврат 3;
	Иначе
		ВызватьИсключение "Неизвестный тип СУБД";
	КонецЕсли;
		
КонецФункции

&НаСервере
Функция ПолучитьКодПараметрыСоединения()
	
	Возврат Объект.ПараметрыСоединения.Код;
	
КонецФункции

&НаСервере
Процедура СформироватьТабличныйДокумент(ТЗ)
   
   ТД = Новый ТабличныйДокумент;
   
   Построитель = Новый ПостроительОтчета;
   
   ИсточникДанных = Новый ОписаниеИсточникаДанных(ТЗ);
   
   Построитель.ИсточникДанных=ИсточникДанных;
   РезультатыЗапроса.Очистить();
   Построитель.Вывести(РезультатыЗапроса);
   
КонецПроцедуры

&НаСервере
Процедура УстановитьТаймаутПриИзмененииНаСервере()
	// Вставить содержимое обработчика.
	ЭтаФорма.Элементы.Таймаут.ТолькоПросмотр = Не Объект.УстановитьТаймаут;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьТаймаутПриИзменении(Элемент)
	УстановитьТаймаутПриИзмененииНаСервере();
КонецПроцедуры

#КонецОбласти
